In [55]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [56]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

In [ ]:
"""
1. Some values in the the FlightNumber column are missing. These numbers are meant
to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in
these missing numbers and make the column an integer column (instead of a float
column).

"""

In [57]:
df["FlightNumber"] = df["FlightNumber"].interpolate().astype(int) # Here default method is linear in interpolate, so i didn't mention..
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)         10045      LoNDon_paris      [23, 47]
1    <Air France> (12)         10055      MAdrid_miLAN            []
2  (British Airways. )         10065  londON_StockhOlm  [24, 43, 87]
3       12. Air France         10075    Budapest_PaRis          [13]
4          "Swiss Air"         10085   Brussels_londOn      [67, 32]

In [ ]:
"""
2. The From_To column would be better as two separate columns! Split each string on
the underscore delimiter _ to give a new temporary DataFrame with the correct values.
Assign the correct column names to this temporary DataFrame.
"""

In [58]:
temp=pd.DataFrame(df["From_To"])
temp["From"]=temp["From_To"].str.split("_").str.get(0)
print("From Column")
print(temp["From"])
temp["To"]=temp["From_To"].str.split("_").str.get(1)
print("To column")
print(temp.To)
temp=temp.drop("From_To",axis=1)
print(temp)

From Column
0      LoNDon
1      MAdrid
2      londON
3    Budapest
4    Brussels
Name: From, dtype: object
To column
0        paris
1        miLAN
2    StockhOlm
3        PaRis
4       londOn
Name: To, dtype: object
       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [ ]:
"""
3. Notice how the capitalisation of the city names is all mixed up in this temporary
DataFrame. Standardise the strings so that only the first letter is uppercase (e.g.
"londON" should become "London".)
"""

In [59]:
temp["From"] = temp["From"].str.title()
temp["To"] = temp["To"].str.title()
print(temp)

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [ ]:
"""
4. Delete the From_To column from df and attach the temporary DataFrame from the
previous questions.
"""

In [60]:
df=df.drop("From_To",axis=1)
df=pd.concat([df,temp],axis=1)
df

               Airline  FlightNumber  RecentDelays      From         To
0               KLM(!)         10045      [23, 47]    London      Paris
1    <Air France> (12)         10055            []    Madrid      Milan
2  (British Airways. )         10065  [24, 43, 87]    London  Stockholm
3       12. Air France         10075          [13]  Budapest      Paris
4          "Swiss Air"         10085      [67, 32]  Brussels     London

In [ ]:
"""
5. In the RecentDelays column, the values have been entered into the DataFrame as a list.
We would like each first value in its own column, each second value in its own column, and so on. 
If there isn't an Nth value, the value should be NaN. 

Expand the Series of lists into a DataFrame named delays, rename the columns delay_1,delay_2, etc.
and replace the unwanted RecentDelays column in df with delays.
"""

In [61]:
df_delay = pd.DataFrame(df["RecentDelays"])
df_delay= pd.DataFrame(df["RecentDelays"].values.tolist())
df_delay.head()
df_delay.columns = ["delay_1","delay_2","delay_3"]
df_delay.head()
                      
df=df.drop("RecentDelays", 1)
df

df.insert(4, "delay_1", df_delay["delay_1"])
df.insert(5, "delay_2", df_delay["delay_2"])
df.insert(6, "delay_3", df_delay["delay_3"])
print(df)

               Airline  FlightNumber      From         To  delay_1  delay_2  \
0               KLM(!)         10045    London      Paris     23.0     47.0
1    <Air France> (12)         10055    Madrid      Milan      NaN      NaN
2  (British Airways. )         10065    London  Stockholm     24.0     43.0
3       12. Air France         10075  Budapest      Paris     13.0      NaN
4          "Swiss Air"         10085  Brussels     London     67.0     32.0

   delay_3
0      NaN
1      NaN
2     87.0
3      NaN
4      NaN